cask_args appdir: "/Applications"

# taps -------------------------------------------------------------------------
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"

# dependencies -----------------------------------------------------------------
brew "coreutils"
brew "go"
brew "mas"
cask "java"

# osx upgrades -----------------------------------------------------------------
brew "bash"
brew "grep"
brew "findutils"

# git --------------------------------------------------------------------------
brew "git"
brew "git-extras"
brew "git-lfs"
brew "bfg"
brew "tig"
brew "icdiff"

# shell ------------------------------------------------------------------------
brew "zsh"
brew "zsh-completions"

# brews ------------------------------------------------------------------------
brew "tldr"
brew "openssl"
brew "curl"
brew "ffmpeg"
brew "foremost"
brew "fzf"
brew "jq"
brew "openssl"
brew "neovim"
brew "nmap"
brew "node"
brew "pwgen"
brew "xz"
brew "python"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "rust"
brew "telnet"
brew "testdisk"
brew "the_platinum_searcher"
brew "the_silver_searcher"
brew "tree"
brew "unrar"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "trash"
brew "shellcheck"
brew "python2"
brew "python3"
brew "netcat"
brew "pwgen"
brew "dos2unix"
brew "htop"
brew "httpie"
brew "todo-txt"
brew "gawk"

# casks ------------------------------------------------------------------------
cask "avidemux"
cask "blender"
cask "natron"
# cask "docker"
cask "docker-edge"
cask "etcher"
cask "firefox"
cask "firefox-developer-edition"
cask "google-chrome"
cask "iterm2"
cask "rawtherapee"
cask "reaper"
cask "spotify"
# cask "tuxguitar"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc"
cask "aerial"
cask "slack"
# cask "grammarly"
cask "caffeine"
cask "insomnia"
cask "google-backup-and-sync"
cask "torbrowser"
cask "the-unarchiver"
cask "keybase"
cask "kap"
cask "muzzle"
cask "ngrok"
cask "sketch"
cask "skype"
cask "xquartz"
cask "duet"
cask "google-hangouts"
cask "handbrake"
cask "sfdx"

# Quicklook --------------------------------------------------------------------
cask "qlcolorcode"
cask "qlmarkdown"
cask "quicklook-json"
cask "quicklook-csv"
cask "qlstephen"
cask "qlimagesize"
cask "webpquicklook"
cask "suspicious-package"
cask "quicklookase"
cask "qlvideo"

# fonts ------------------------------------------------------------------------
cask "caskroom/fonts/font-droidsansmono-nerd-font"
cask "caskroom/fonts/font-droidsansmono-nerd-font-mono"
cask "caskroom/fonts/font-firacode-nerd-font"
cask "caskroom/fonts/font-firacode-nerd-font-mono"
cask "caskroom/fonts/font-firamono-nerd-font"
cask "caskroom/fonts/font-firamono-nerd-font-mono"

# app store apps ---------------------------------------------------------------
mas "Magnet", id: 441258766
mas "Pocket", id: 568494494
mas "Gapplin", id: 768053424
mas "Giphy Capture", id: 668208984


